<a href="https://colab.research.google.com/github/neethj/feature-engineering/blob/main/handling_categorical_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount("/content/gdrive")

Mounted at /content/gdrive

In [3]:
df = pd.read_csv("/content/gdrive/MyDrive/kaggle/titanic.zip (Unzipped Files)/train.csv",usecols=["Sex"])

In [4]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

## handling categorical features

#one hot encoding

 here we have made a one hot enocing of the sex, here it isnt necessary for both the columns to exist inorder for us to know whether it is male or female. just one column is sufficient

In [5]:
pd.get_dummies(df)

     Sex_female  Sex_male
0             0         1
1             1         0
2             1         0
3             1         0
4             0         1
..          ...       ...
886           0         1
887           1         0
888           1         0
889           0         1
890           0         1

[891 rows x 2 columns]




## here we have dropped the first column

In [6]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [7]:
df = pd.read_csv("/content/gdrive/MyDrive/kaggle/titanic.zip (Unzipped Files)/train.csv",usecols=["Embarked"])

In [8]:
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [9]:
## we drop the nan values bcos now we dont want to deal with that
df["Embarked"].dropna(inplace=True)

In [10]:
 df.head(10)

  Embarked
0        S
1        C
2        S
3        S
4        S
5        Q
6        S
7        S
8        S
9        C

In [11]:
pd.get_dummies(df, drop_first=False)
## if we want we can drop the first value

     Embarked_C  Embarked_Q  Embarked_S
0             0           0           1
1             1           0           0
2             0           0           1
3             0           0           1
4             0           0           1
..          ...         ...         ...
886           0           0           1
887           0           0           1
888           0           0           1
889           1           0           0
890           0           1           0

[891 rows x 3 columns]

The disadvantage of one hot encoding is that it creates a lot of columns, curse of dimensinality.
suppose we have a value of lot of pincodes, then it will create large num of columns which will be useless to look at

## kdd cup challenge technique, 
in this technique, they took the 10 most frequent categories of each feature and applied one hot encoding on those categories only. they won tge challenge with this method.

In [12]:
df= pd.read_csv("/content/gdrive/MyDrive/kaggle/mercedestrain.csv.zip (Unzipped Files)/mercedes.csv",usecols=["X1","X2","X3","X4","X5","X6"])

In [13]:
df.head()

  X1  X2 X3 X4 X5 X6
0  v  at  a  d  u  j
1  t  av  e  d  y  l
2  w   n  c  d  x  j
3  t   n  f  d  x  l
4  v   n  f  d  h  d

In [15]:
df["X1"].value_counts()

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
w      52
z      46
u      37
e      33
m      32
t      31
h      29
f      23
y      23
j      22
n      19
k      17
p       9
g       6
q       3
ab      3
d       3
Name: X1, dtype: int64

In [14]:
df["X1"].unique()

array(['v', 't', 'w', 'b', 'r', 'l', 's', 'aa', 'c', 'a', 'e', 'h', 'z',
       'j', 'o', 'u', 'p', 'n', 'i', 'y', 'd', 'f', 'm', 'k', 'g', 'q',
       'ab'], dtype=object)

In [19]:
##code to get the top 10 frequent categories in X1
frequent = df["X1"].value_counts(ascending=False).head(10).index

In [21]:
## we convert it into a list
frequent = list(frequent)

In [23]:
frequent

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [24]:
for category in frequent:
  df[category]=np.where(df["X1"]==category,1,0)

In [28]:
frequent.append("X1")

In [30]:
df[frequent].head(15)

    aa  s  b  l  v  r  i  a  c  o X1
0    0  0  0  0  1  0  0  0  0  0  v
1    0  0  0  0  0  0  0  0  0  0  t
2    0  0  0  0  0  0  0  0  0  0  w
3    0  0  0  0  0  0  0  0  0  0  t
4    0  0  0  0  1  0  0  0  0  0  v
5    0  0  1  0  0  0  0  0  0  0  b
6    0  0  0  0  0  1  0  0  0  0  r
7    0  0  0  1  0  0  0  0  0  0  l
8    0  1  0  0  0  0  0  0  0  0  s
9    0  0  1  0  0  0  0  0  0  0  b
10   0  0  0  0  0  1  0  0  0  0  r
11   0  0  0  0  0  1  0  0  0  0  r
12   0  0  1  0  0  0  0  0  0  0  b
13   0  0  0  0  0  1  0  0  0  0  r
14   0  1  0  0  0  0  0  0  0  0  s